Ran Plan for project: `wrestleutopia-prod` dir: `accounts/wrestleutopia-prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-multiaccounts.tfvars with secrets from SSM.


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.media_cf_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "media_cf_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "AllowCloudFrontOACRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket",
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyUnencryptedObjectUploads"

          + condition {
              + test     = "StringNotEquals"
              + values   = [
                  + "AES256",
                ]
              + variable = "s3:x-amz-server-side-encryption"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:DeleteObjectTagging",
              + "s3:PutObject",
              + "s3:PutObjectTagging",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
            ]
          + sid       = "DenyIfNotFromOurOrg"

          + condition {
              + test     = "ArnNotEqualsIfExists"
              + values   = [
                  + "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078",
                ]
              + variable = "AWS:SourceArn"
            }
          + condition {
              + test     = "StringNotEqualsIfExists"
              + values   = [
                  + "o-4uer5s3xlw",
                ]
              + variable = "aws:PrincipalOrgID"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_cloudfront_distribution.media will be updated in-place
~ resource "aws_cloudfront_distribution" "media" {
        id                              = "E38TFLPKVTD078"
        tags                            = {}
        # (24 unchanged attributes hidden)

      - origin {
          - connection_attempts         = 3 -> null
          - connection_timeout          = 10 -> null
          - domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com" -> null
          - origin_access_control_id    = "E13MPCJ2G0S1JT" -> null
          - origin_id                   = "media-s3-origin" -> null
          - response_completion_timeout = 0 -> null
            # (1 unchanged attribute hidden)
        }
      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "prod-wrestleutopia-media-bucket.s3.us-east-2.amazonaws.com"
          + origin_access_control_id    = "E13MPCJ2G0S1JT"
          + origin_id                   = "media-s3-origin"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)

          + s3_origin_config {
                # (1 unchanged attribute hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.media_cf will be updated in-place
~ resource "aws_s3_bucket_policy" "media_cf" {
        id     = "prod-wrestleutopia-media-bucket"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "AllowCloudFrontOACRead"
                    },
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket/*",
                          - "arn:aws:s3:::prod-wrestleutopia-media-bucket",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringNotEquals = {
                              - "s3:x-amz-server-side-encryption" = "AES256"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyUnencryptedObjectUploads"
                    },
                  - {
                      - Action    = [
                          - "s3:PutObjectTagging",
                          - "s3:PutObject",
                          - "s3:DeleteObjectTagging",
                          - "s3:DeleteObject",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Condition = {
                          - ArnNotEqualsIfExists    = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::390402544450:distribution/E38TFLPKVTD078"
                            }
                          - StringNotEqualsIfExists = {
                              - "aws:PrincipalOrgID" = "o-4uer5s3xlw"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = "arn:aws:s3:::prod-wrestleutopia-media-bucket/*"
                      - Sid       = "DenyIfNotFromOurOrg"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p wrestleutopia-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.feedutopia.com:4141/lock?id=ryan-longoria%252FFeedUtopia%252Faccounts%252Fwrestleutopia-prod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p wrestleutopia-prod
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```